<?

if ( ! function_exists('transliterate'))
{
 function transliterate ($text){
  $trans = array("а"=>"a","б"=>"b","в"=>"v","г"=>"g","д"=>"d","е"=>"e", "ё"=>"yo","ж"=>"j","з"=>"z","и"=>"i","й"=>"i","к"=>"k","л"=>"l", 
  "м"=>"m","н"=>"n","о"=>"o","п"=>"p","р"=>"r","с"=>"s","т"=>"t", "у"=>"u","ф"=>"f","х"=>"h","ц"=>"c","ч"=>"ch", "ш"=>"sh","щ"=>"sh",
  "ы"=>"i","э"=>"e","ю"=>"u","я"=>"ya","А"=>"a","Б"=>"b","В"=>"v","Г"=>"g","Д"=>"d","Е"=>"e","Ё"=>"yo","Ж"=>"j","З"=>"z","И"=>"i",
  "Й"=>"i","К"=>"k","Л"=>"l","М"=>"m","Н"=>"n","О"=>"o","П"=>"p","Р"=>"r","С"=>"s","Т"=>"t","У"=>"u","Ф"=>"f", "Х"=>"h","Ц"=>"c",
  "Ч"=>"ch","Ш"=>"sh","Щ"=>"sh", "Ы"=>"i","Э"=>"e","Ю"=>"u","Я"=>"ya","ь"=>"","Ь"=>"","ъ"=>"","Ъ"=>""," "=>"-","'"=>"","`"=>"");
  return strtr($text, $trans);
 }
}


?>